#version: 0.2
c l
h #
i x
a x
i y
t cl
k cl
i h
d cl
a e
e h
ax r
a a
a o
d h
d x
p cl
a y
a h
e y
s h
g cl
o w
e r
b cl
u x
e p
ep i
n g
j h
h v
n x
h h
a u
p au
e l
c h
t h
a w
e n
o y
u w
u h
- h
ax -h
z h
e m
e ng
